using System;

/*
 Task 14
 * Да се напише програма, която въвежда час и минути от 24-часово денонощие и изчислява колко ще е часът след 15 минути. 
 * Резултатът да се отпечата във формат hh:mm. Часовете винаги са между 0 и 23, а минутите винаги са между 0 и 59. 
 * Часовете се изписват с една или две цифри. Минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо
 */
class TimePluse15Minutes
{
    static void Main()
    {
        int hour = int.Parse(Console.ReadLine());
        int minutes = int.Parse(Console.ReadLine());

        //ако сме в интервала 15 мин преди полунощ
        if (minutes >= 45 && minutes <= 59)
        {
            if (hour == 23)
            {
                hour = 0;
            }
            else
            {
                //hour = hour + 1
                hour++;
            }

            //    //(59 - minutes) това е интервала, който остава до полунощ
            //    //-1 заради това, че имаме 00:00 
            minutes = 15 - (59 - minutes) - 1;
        }
        else
        {
            //ако не сме в интервала 15 мин преди полунощ
            minutes = minutes + 15;
        }

        // Минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо
        if (minutes < 10)
        {
            Console.WriteLine("{0}:0{1}", hour, minutes);
        }
        else
        {
            Console.WriteLine("{0}:{1}", hour, minutes);
        }
    }
}
